app/controllers/events_controller.rb

  def index
    #make list of new events
    all_events = Event.all.sort_by(&:eventdate).reverse
---
SELECT "events".* FROM "events"

  def archive
    if params[:page]
      @page = params[:page].to_i
    else
      @page = 0
    end

    #make list of old events
    all_events = Event.all.sort_by(&:eventdate).reverse
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "description", "doors", "entryfee", "eventdate", "galleryset_id", "name", "published", "showstart", "sticky", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "events" SET "eventdate" = '2010-01-04', "updated_at" = '2013-01-04 12:59:36.432511' WHERE "events"."id" = 9

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 7]]