app/controllers/guestbook_entries_controller.rb

SELECT "guestbook_entries".* FROM "guestbook_entries"
---
  def index
    if params[:page]
      @page = params[:page].to_i
    else
      @page = 0
    end

    all_guestbook_entries = GuestbookEntry.all

SELECT "guestbook_entries".* FROM "guestbook_entries" WHERE "guestbook_entries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @guestbook_entry = GuestbookEntry.find(params[:id])

SELECT "guestbook_entries".* FROM "guestbook_entries" WHERE "guestbook_entries"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @guestbook_entry = GuestbookEntry.find(params[:id])

INSERT INTO "guestbook_entries" ("created_at", "datetime", "email", "message", "name", "posted_time", "refer_to", "town", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @guestbook_entry = GuestbookEntry.new(params[:guestbook_entry])

    respond_to do |format|
      if @guestbook_entry.save

SELECT "guestbook_entries".* FROM "guestbook_entries" WHERE "guestbook_entries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "guestbook_entries" WHERE "guestbook_entries"."id" = ?  [["id", 1]]
---
  def destroy
    @guestbook_entry = GuestbookEntry.find(params[:id])
    @guestbook_entry.destroy