app/controllers/members_controller.rb

  def index
    if params[:letter]
      @letter = params[:letter]
      if (@letter < "A" || @letter > "Z") && (@letter != "0")
        @letter = "A"
      end
    else
      @letter = "A"
    end
    members_all = Member.all.sort_by(&:lastname)
---
SELECT "members".* FROM "members"

  def show
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("birthday", "created_at", "encrypted_address_street", "encrypted_address_town", "encrypted_address_zip", "encrypted_bankaccount_bankname", "encrypted_bankaccount_blz", "encrypted_bankaccount_nr", "encrypted_email", "encrypted_firstname", "encrypted_lastname", "encrypted_telephone", "entrydate", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @member = Member.find(params[:id])

    respond_to do |format|
      if @member.update_attributes(params[:member])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "members" SET "bankaccount_nr" = '1234', "bankaccount_blz" = '5678', "updated_at" = '2013-01-01 21:47:22.018721' WHERE "members"."id" = 1

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", nil]]