app/controllers/users_controller.rb

  def index
    @user = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "firstname", "job", "lastname", "password_digest", "title", "updated_at", "usertyp") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def noframe
    @user = User.all
---
SELECT "users".* FROM "users"